{
  "level1": {
    "semester1": [
      {
        "id": "digital-educational-communication",
        "title": "الاتصال التعليمي الرقمي",
        "description": "يهدف المقرر إلى دراسة تطور الفكر الإنساني في مجال الاتصال والاعلام من خلال عرض وتحليل أبرز نماذج ونظريات الإعلام الحديثة والمعاصرة في مجالات الإعلام المختلفة مثل: النظريات الخاصة بالوسيلة الاعلامية القائم بالاتصال، وكذلك النظريات الخاصة بالجمهور والتأثير الرأى العام، وانتشار المعلومات ومعالجتها، والمجتمع الجماهيري المجتمع الشبكي في اطار الاعلام الجديد"
      },
      {
        "id": "radio-and-audio-recordings",
        "title": "الاذاعة والتسجيلات الصوتية",
        "description": "يهدف المقرر إلى دراسة مفهوم الإنتاج الإذاعي وكتابة السيناريو والمسلسل والريبورتاج والمجلة الإذاعية والبرامج العامة للإذاعة وما تحويه من مواد ثقافية"
      },
      {
        "id": "theoretical-foundations-of-integrated-media",
        "title": "الاسس النظرية للوسائط المتكاملة",
        "description": "يهدف المقرر إلى دراسة الوسائط المتكاملة والأسس النظرية المرتبطة بإدراكها، وكيفية رؤية الأشياء الثابتة والمتحركة، وصفات إدراك هذه الوسائط، والعوامل التي تؤثر في الإدراك، وعوامل سرعة إدراك الوسائط المرئية والمسموعة والملموسة، والتمثيل المعرفي لها داخل الدماغ"
      },
      {
        "id": "introduction-to-instructional-design",
        "title": "مدخل الى التصميم التعليمي",
        "description": "يهدف المقرر إلى دراسة المفاهيم الأساسية للتصميم التعليمي ومهارته وأهميته وعلاقته بتكنولوجيا التعليم والمواقف التعليمية الحقيقية والإلكترونية ويشتمل المقرر على المجالات الرئيسة لعلم التصميم التعليمي"
      },
      {
        "id": "educational-computer-networks",
        "title": "شبكات الكمبيوتر التعليمية",
        "description": "تهدف إلى تقديم فهم عميق للمفاهيم الأساسية والمتقدمة في شبكات الكمبيوتر وكيفية استخدام هذه الشبكات في التعليم والتدريب التفاعلي"
      },
      {
        "id": "e-learning-environments",
        "title": "بيئات التعلم الالكتروني",
        "description": "تهدف إلى تزويد الطلاب بالمعرفة والمهارات اللازمة لتصميم وتطوير بيئات تعليمية تعتمد على التكنولوجيا، وتعزز من استخدام الوسائل الإلكترونية لتسهيل التعلم وتفاعل الطلاب في ظل العوامل الرقمية الحديثة"
      }
    ],
    "semester2": [
      {
        "id": "photography",
        "title": "التصوير الفوتوغرافي",
        "description": "يهدف المقرر إلى دراسة مفهوم التصوير الضوئي الرقمي، ونشأته وتاريخه وتطوره وصولاً للصورة الرقمية المتحركة ويشتمل المقرر على الإمكانيات التربوية للصور الثابتة والمتحركة وسعة كل منها والاحتياجات الفنية داخل المعمل الرقمي ومراحل الإنتاج"
      },
      {
        "id": "e-learning",
        "title": "التعليم الالكتروني",
        "description": "يهدف المقرر إلى دراسة التعليم الالكتروني وخصائصه، وأهدافه ومميزاته وتحدياته، وكذلك تصنيفاته، مع التطرق لمفهوم بيئات التعليم الإلكتروني وأنواعها ومعايير تصميمها"
      },
      {
        "id": "static-and-animated-educational-graphics",
        "title": "الرسومات التعليمية الثابتة والمتحركة",
        "description": "يهدف المقرر إلى دراسة الرسومات الثابتة وأنواعها وتوظيفها التعليمي، وتعريف الرسومات المتحركة ويشتمل المقرر على توظيف الرسومات الثابتة التعليمي، مع التأكيد على رسومات الأنفوجرافيك وأنواعها وأهميتها التعليمية وخطوات تصميمها"
      },
      {
        "id": "readings-in-english",
        "title": "قراءات في التخصص باللغة الانجليزية",
        "description": "هدف المقرر إلى دراسة المعارف والمهارات والأساليب التي تمكن الطلاب من الاستفادة من الموضوعات المتنوعة في مجال التعليم المتاحة باللغة الإنجليزية وتطبيقاتها في العملية التعليمية مثل تطبيقات الويب المتنوعة"
      },
      {
        "id": "digital-learning-resource-centers",
        "title": "مراكز مصادر التعلم الرقمي",
        "description": "تهدف إلى تزويد الطلاب بالمعرفة والمهارات اللازمة لإنشاء وإدارة مراكز مصادر التعلم الرقمية، والتي تمثل بيئات تعليمية تعتمد على تكنولوجيا المعلومات والاتصالات لتوفير مصادر تعلم متنوعة ومتكاملة"
      },
      {
        "id": "interactive-virtual-technology",
        "title": "التكنولوجيا الافتراضية التفاعلية",
        "description": "يهدف المقرر إلى دراسة التكنولوجيات التفاعلية كالهولولينس، وفكرة الدمج بين البيئة الواقعية والافتراضية، واستعراض للأجهزة المكونة لتكنولوجيا الهولولينس والنظارة العارضة لهذه التكنولوجيات التفاعلية والنظريات المعرفية المرتبطة بهذه التكنولوجيا"
      }
    ]
  },
  "level2": {
    "semester1": [
      {
        "id": "simulation-methods-and-design",
        "title": "اساليب المحاكاه وتصميمها",
        "description": "يهدف المقرر إلى دراسة المفاهيم الأساسية لمحاكاة الكمبيوتر ومستويتها وتصنيفها وعناصرها ومميزاتها وعيوبها والمعايير اللازمة لتصميم برامج المحاكاة القائمة على الويب"
      },
      {
        "id": "multimedia-environments-for-special-groups",
        "title": "تصميم وانتاج بيئات الوسائط المتكاملة للفئات الخاصة",
        "description": "بهدف المقرر الى دراسة الأسس والمبادئ النظرية والتطبيقية الخاصة بالوسائط المتكاملة ذات الصلة بالفئات الخاصة من الموهوبين والمعاقين"
      },
      {
        "id": "digital-empowerment",
        "title": "التمكين الرقمي",
        "description": "يهدف المقرر إلى اكساب الطلاب المعارف والمهارات المرتبطة بالتحول الرقمي من حيث المفهوم والأهداف والأهمية والوظائف والفوائد والمهارات اللازمة للطالب عند إعداد وتصميم المواقع والمقررات الالكترونية"
      },
      {
        "id": "digital-applications-in-education",
        "title": "توظيف التطبيقات الرقمية في التعليم",
        "description": "يهدف المقرر إلى التزويد بالمعارف والمهارات المرتبطة بالتطبيقات الرقمية في التعليم، ويتناول ايضاً تحليل تفصيلي لبعض التطبيقات الرقمية التعليمية"
      },
      {
        "id": "3d-learning-resources",
        "title": "مصادر التعلم ثلاثية الابعاد",
        "description": "تهدف إلى تقديم معرفة معمقة حول استخدام تقنيات الواقع ثلاثي الأبعاد في تحسين وتطوير مصادر التعلم. تركز المادة على استخدام الأدوات التكنولوجية الحديثة لإنشاء بيئات تعليمية تفاعلية باستخدام النماذج ثلاثية الأبعاد، ما يعزز من تجربة التعلم ويجعلها أكثر جذبًا وتفاعلًا"
      },
      {
        "id": "digital-images-production-and-processing",
        "title": "الصور الرقمية انتاجها ومعالجتها",
        "description": "تهدف إلى تزويد الطلاب بالمعرفة والمهارات اللازمة لإنشاء ومعالجة الصور الرقمية باستخدام الأدوات والتقنيات الحديثة. تركز المادة على كيفية استخدام الصور الرقمية في السياقات التعليمية لتعزيز تجربة التعلم وجعلها أكثر جذبًا وتفاعلاً، بالإضافة إلى فهم تقنيات معالجة الصور واستخدامها بفعالية في مجالات متعددة"
      }
    ],
    "semester2": [
      {
        "id": "e-book-design",
        "title": "تصميم الكتاب الالكتروني",
        "description": "يهدف المقرر إلى دراسة الكتاب الإلكتروني وتاريخه ومراحل تطوره، وأنواعه وأشكاله والمفاهيم والمصطلحات ويشتمل المقرر على المهارات الخاصة بعمليات تصميم الكتاب التعليمي الإلكتروني من حيث النصوص الصور والرسومات، وتنظيم محتواه. وكذلك مزاياه وعيوبه"
      },
      {
        "id": "educational-websites-design-and-production",
        "title": "تصميم وانتاج المواقع التعليمية",
        "description": "بهدف المقرر إلى دراسة المعارف والمهارات المرتبطة بتصميم المواقع وأسس التصميم والبناء للأنواع المختلفة والتدريب على إدارتها، وكذلك إبراز المعلومات على صفحات الإنترنت وما يشمل ذلك من تقديم خدمات وقواعد بيانات على هذه المواقع"
      },
      {
        "id": "educational-games-design-and-production",
        "title": "تصميم وانتاج الالعاب التعليمية",
        "description": "يهدف المقرر إلى دراسة الألعاب التعليمية الإلكترونية واستخدامها كمصدر للتعلم ويشتمل المقرر على طريقة اختيارها وطريقة تصميمها وكيفية اختيارها أنسب التطبيقات لتصميم الألعاب والمسابقات والدروس التفاعلية"
      },
      {
        "id": "educational-tv-programs-design-and-production",
        "title": "تصميم وانتاج برامج التلفزيون التعليمي",
        "description": "يهدف المقرر إلى دراسة التلفزيون التعليمي، وصفات وسعة الحركة داخله. ويشتمل المقرر على تعرف الأسس النظرية لإنتاج البرامج التلفزيونية والفيديو الرقمي، وكاميرا التصوير التليفزيونية الرقمية. والقواعد الأساسية لإنتاج صورة بالكاميرا التليفزيونية الرقمية"
      },
      {
        "id": "adaptive-learning-environments",
        "title": "بيئات التعلم التكيفية",
        "description": "يهدف المقرر إلى دراسة مفهوم النظم الذكية وأنواعها والنظريات النفسية الداعمة لها، مع العرض لعدد من الأمثلة للأساليب والأنظمة الذكية المستخدمة داخله كالفصول الذكية المدمجة والبوابات الأكاديمية والأنظمة البديلة لإدارة التعلم والمدونات وغيرها"
      },
      {
        "id": "augmented-reality-technology",
        "title": "تكنولوجيا الواقع المعزز",
        "description": "تهدف إلى تزويد الطلاب بالمعرفة والمهارات اللازمة لفهم واستخدام تقنيات الواقع المعزز (AR) في العملية التعليمية. تركز المادة على كيفية دمج الواقع المعزز في بيئات التعلم لتوفير تجارب تفاعلية وغامرة تعزز من فهم الطلاب للمواد الدراسية"
      },
      {
        "id": "learning-resources-for-special-groups",
        "title": "مصادر التعلم للفئات الخاصة",
        "description": "تهدف إلى تقديم معرفة متعمقة حول كيفية تصميم وتوفير مصادر تعلم مخصصة لاحتياجات الفئات الخاصة مثل ذوي الاحتياجات الخاصة (التعليم الخاص). تركز المادة على كيفية استخدام التكنولوجيا والمصادر التعليمية المختلفة لدعم عملية التعلم للطلاب ذوي الإعاقات المختلفة، سواء كانت حركية، سمعية، بصرية، أو ذهنية"
      }
    ]
  },
  "level3": {
    "semester1": [
      {
        "id": "theoretical-foundations-for-special-groups",
        "title": "الاسس النظرية لتكنولوجيا تعليم الفئات الخاصة",
        "description": "يهدف المقرر إلى دراسة مفهوم الفئات الخاصة وأنواعها وأسباب الإعاقات وتصنيفها والخصائص المعرفية والجسدية والنفسية والاجتماعية لكل فئة، وطرق تعليمهم والتواصل معهم"
      },
      {
        "id": "educational-websites-production",
        "title": "انتاج المواقع التعليمية",
        "description": "تهدف إلى تزويد الطلاب بالمعرفة والمهارات اللازمة لتصميم وتطوير مواقع تعليمية تفاعلية باستخدام أدوات وتقنيات تكنولوجيا المعلومات. تركز المادة على كيفية إنشاء مواقع تعليمية فعالة تدعم العملية التعليمية وتوفر محتوى تعليمي متنوع ومرن"
      },
      {
        "id": "digital-learning-environments-and-tools",
        "title": "بيئات التعلم الرقمية وادواتها",
        "description": "يهدف المقرر إلى دراسة تنظيم البيئات التعليمية الواقعية وإدارتها ودور تكنولوجيا التعليم في ذلك، حيث يركز على استعراض المكونات البيئة التعليمية الواقعية بما فيها من مكونات فيزيقية وغير فيزيقية من حيث المواصفات الفنية والتربوية لمبانيها واستعراض أنواع هذه المباني وتفاعلها مع البيئة المحيطة"
      },
      {
        "id": "digital-content-management-systems",
        "title": "نظم ادارة المحتوى الرقمي",
        "description": "يهدف المقرر إلى دراسة مفهوم إدارة المحتوى الرقمي، مع التركيز على المهارات المرتبطة بنظم إدارة التعلم الرقمي"
      },
      {
        "id": "educational-game-motivators",
        "title": "محفزات الالعاب التعليمية",
        "description": "يهدف المقرر الى دراسة المحفزات التعليمية وعناصرها ومكوناتها وأنواعها وأهدافها وفوائدها وكيفية توظيفها في البرامج والمقررات الرقمية العادية والتكيفية"
      },
      {
        "id": "educational-virtual-museums",
        "title": "المتاحف الافتراضية التعليمية",
        "description": "تهدف إلى تعريف الطلاب بكيفية استخدام المتاحف الافتراضية كأداة تعليمية تفاعلية مبتكرة تدعم العملية التعليمية من خلال توفير بيئات رقمية تحاكي المتاحف الحقيقية. تركز المادة على استخدام التكنولوجيا لإنشاء وتجربة المتاحف الافتراضية، وتتيح للطلاب فرصة استكشاف المحتوى التعليمي بطريقة حديثة ومثيرة"
      },
      {
        "id": "educational-robotics",
        "title": "الروبوتات التعليمية",
        "description": "تقديم فهم شامل حول كيفية استخدام الروبوتات في تحسين العملية التعليمية. تركز المادة على دمج تقنيات الروبوتات مع أساليب التعليم الحديثة لتطوير بيئات تعلم تفاعلية وفعالة، مما يعزز من قدرة الطلاب على الفهم والتفاعل مع المحتوى التعليمي بشكل مبتكر"
      }
    ],
    "semester2": [
      {
        "id": "programming-and-applications",
        "title": "البرمجة وتطبيقاتها",
        "description": "يهدف المقرر إلى دراسة أساسيات البرمجة والمهارات المرتبطة بها، ومفهوم الخوارزمية، وتصميم خوارزمية سليمة لحل المشكلات بشكل منطقي، وكذلك إلى تزويد الطلاب بأنواع البرمجة المختلفة واللغات الخاصة بها، والتعرف على خرائط التدفق ودورها في البرمجة"
      },
      {
        "id": "learning-analytics-in-educational-environments",
        "title": "تحليلات التعلم في البيئات التعليمية",
        "description": "يهدف المقرر إلى دراسة تحليلات التعلم وتطورها والأسس القائمة عليها، وكذلك الحديث عن الفجوة في التطبيق، ثم التطرق بتحليلات التعلم وعلاقتها بنظم إدارة التعلم، والعائد التربوي لها، مع استعراض لعدد من النماذج"
      },
      {
        "id": "e-courses-design-and-production",
        "title": "تصميم المقررات الالكترونية وانتاجها",
        "description": "يهدف المقرر إلى إعداد وتصميم المواقع والمقررات الالكترونية"
      },
      {
        "id": "accelerated-learning-and-smart-surfaces",
        "title": "التعلم المعجل والاسطح الذكية",
        "description": "يهدف المقرر إلى دراسة التعلم المعجل وأهميته وتوظيفه في ظل التحول الرقمي وربط المستحدثات التكنولوجية المتمثلة في الأسطح الذكية، مع التركيز على فكرة عملها ودورها التربوي في تحقيق أعلى إنجاز لهذا النوع من التعلم"
      },
      {
        "id": "user-interfaces-in-virtual-learning-environments",
        "title": "وجهات المستخدم في بيئات التعلم الافتراضية",
        "description": "يهدف المقرر إلى دراسة واجهات المستخدم في البيئات التعليمية الافتراضية، وتصنيفاتها بداية من واجهة المستخدم بالأوامر مرورا بواجهة المستخدم اللمسية والطبيعية والعضوية مع التركيز على بيئات المستخدم ثلاثية الأبعاد"
      },
      {
        "id": "interactive-video-environments",
        "title": "بيئات الفيديو التفاعلي",
        "description": "يهدف المقرر الى دراسة الأنظمة الرقمية الحديثة ودعم الطرائق التعليمية لمختلف فئات المتعلمين، وكذلك ربطها بالبرمجة اللغوية العصبية NLP وتناولها لتقسيم الأنظمة التمثيلية للإنسان"
      },
      {
        "id": "cybersecurity-in-education",
        "title": "الامن السيبراني في التعليم",
        "description": "يهدف المقرر الى دراسة المعلوماتية وأمن المعلومات وأخلاقيات تداول المعلومات عبر الانترنت مع التركيز على السلوك الأخلاقي المرتبط باستخدام مصادر التعلم، كما يتناول المقرر المسئوليات المهنية والأخلاقية، وأمن المعلومات والبيانات الخصوصية"
      }
    ]
  },
  "level4": {
    "semester1": [
      {
        "id": "graduation-project-extended",
        "title": "مشروع التخرج (ممتد)",
        "description": "تهدف إلى تمكين الطلاب من تطبيق المعارف والمهارات التي اكتسبوها خلال دراستهم في مشروع تطبيقي يخص تكنولوجيا التعليم والمعلومات. يتضمن المشروع تصميم أو تطوير أداة أو نظام أو دراسة بحثية في مجال تكنولوجيا التعليم، ويُعد هذا المشروع جزءًا أساسيًا من متطلبات التخرج"
      },
      {
        "id": "action-research-extended",
        "title": "بحوث الفعل (ممتد)",
        "description": "تهدف إلى تزويد الطلاب بالمعرفة والمهارات اللازمة لتنفيذ أبحاث تهدف إلى تحسين وتطوير ممارسات التعليم. تركز هذه المادة على أسلوب البحث التطبيقي الذي يتم تنفيذه في سياقات التعليم الفعلي"
      },
      {
        "id": "field-training-4",
        "title": "التدريب الميداني (٤)",
        "description": "تهدف إلى تزويد الطلاب بتجربة عملية في تطبيق ما تعلموه في المجال الأكاديمي في بيئة تعليمية حقيقية. تركز المادة على إكساب الطلاب مهارات العمل الميداني في تكنولوجيا التعليم، وتدريبهم على التعامل مع التحديات الفعلية التي قد يواجهونها في الميدان، مما يساعدهم على تطوير مهاراتهم المهنية وتطبيق المعرفة النظرية في سياقات تعليمية عملية"
      }
    ],
    "semester2": [
      {
        "id": "graduation-project-extended-continued",
        "title": "مشروع التخرج (ممتد)",
        "description": "استمرار لمشروع التخرج من الفصل الدراسي السابق، حيث يقوم الطلاب بإكمال وتطوير مشاريعهم التطبيقية في مجال تكنولوجيا التعليم والمعلومات"
      },
      {
        "id": "action-research-extended-continued",
        "title": "بحوث الفعل (ممتد)",
        "description": "استمرار لمادة بحوث الفعل من الفصل الدراسي السابق، حيث يقوم الطلاب بإكمال وتطوير أبحاثهم التطبيقية في مجال تحسين وتطوير ممارسات التعليم"
      },
      {
        "id": "field-training-5",
        "title": "التدريب الميداني (٥)",
        "description": "استمرار للتدريب الميداني، حيث يتم تعميق خبرة الطلاب العملية في تطبيق ما تعلموه في المجال الأكاديمي في بيئة تعليمية حقيقية، مع التركيز على تطوير مهاراتهم المهنية بشكل أكبر"
      }
    ]
  }
}

